Repository: evilhack28/z-editor-flutter
Catalog: lib/l10n/app_*.arb
Languages: ru, zh

# appTitle
source: My Level Library
ru: Моя библиотека уровней
zh: 我的关卡库

source: About
ru: О программе
zh: 关于

source: Back
ru: Назад
zh: 返回

source: Refresh
ru: Обновить
zh: 刷新

source: Toggle theme
ru: Переключить тему
zh: 切换主题

source: Switch folder
ru: Сменить папку
zh: 切换目录

source: Clear cache
ru: Очистить кэш
zh: 释放缓存

source: UI size
ru: Размер интерфейса
zh: 界面大小

# aboutSoftware
source: About
ru: О программе
zh: 关于软件

source: Select folder
ru: Выбрать папку
zh: 选择文件夹

# initSetup
source: Initial setup
ru: Начальная настройка
zh: 初始化设置

# selectFolderPrompt
source: Please select a folder as the level storage directory.
ru: Выберите папку для хранения уровней.
zh: 请选择一个文件夹作为关卡存储目录。

# selectFolderButton
source: Select folder
ru: Выбрать папку
zh: 选择文件夹

# emptyFolder
source: Folder is empty
ru: Папка пуста
zh: 文件夹为空

source: New folder
ru: Новая папка
zh: 新建文件夹

source: New level
ru: Новый уровень
zh: 新建关卡

source: Rename
ru: Переименовать
zh: 重命名

source: Delete
ru: Удалить
zh: 删除

source: Copy
ru: Копировать
zh: 复制

source: Move
ru: Переместить
zh: 移动

source: Cancel
ru: Отмена
zh: 取消

source: Confirm
ru: Подтвердить
zh: 确定

source: Create
ru: Создать
zh: 创建

source: New name
ru: Новое имя
zh: 新名称

source: Folder name
ru: Имя папки
zh: 文件夹名称

source: Confirm delete
ru: Подтвердить удаление
zh: 确认删除

# confirmDeleteMessage
source: Are you sure you want to delete "{name}"? {detail}
ru: Вы уверены, что хотите удалить «{name}»? {detail}
zh: 确定要删除 "{name}" 吗？{detail}

# folderDeleteDetail
source: If it is a folder, its contents will also be deleted.
ru: Если это папка, её содержимое также будет удалено.
zh: 如果是文件夹，其内容也将被删除。

# levelDeleteDetail
source: This action cannot be undone.
ru: Это действие нельзя отменить.
zh: 此操作不可恢复。

# confirmDeleteCheckbox
source: I confirm permanent deletion
ru: Я подтверждаю безвозвратное удаление
zh: 我确定要永久删除

# renameSuccess
source: Renamed successfully
ru: Переименовано успешно
zh: 重命名成功

# renameFail
source: Rename failed, file already exists
ru: Ошибка переименования, файл уже существует
zh: 重命名失败，已有同名文件

source: Deleted
ru: Удалено
zh: 已删除

source: Copy level
ru: Копировать уровень
zh: 复制关卡

source: New file name
ru: Новое имя файла
zh: 新文件名

# copySuccess
source: Copy successful
ru: Копирование выполнено
zh: 复制成功

# copyFail
source: Copy failed
ru: Ошибка копирования
zh: 复制失败

# moving
source: Moving: {name}
ru: Перемещение: {name}
zh: 正在移动: {name}

# movePrompt
source: Navigate to target folder, then tap Paste
ru: Перейдите в целевую папку и нажмите «Вставить»
zh: 请导航至目标文件夹，然后点击粘贴

source: Paste
ru: Вставить
zh: 粘贴

source: Folder created
ru: Папка создана
zh: 文件夹创建成功

# createFail
source: Create failed
ru: Ошибка создания
zh: 创建失败

# noTemplates
source: No templates found
ru: Шаблоны не найдены
zh: 未找到模板

# newLevelTemplate
source: New level - Select template
ru: Новый уровень — выбор шаблона
zh: 新建关卡 - 选择模板

source: Name level
ru: Название уровня
zh: 命名关卡

source: Level created
ru: Уровень создан
zh: 创建成功

# levelCreateFail
source: Create failed, file already exists
ru: Ошибка создания, файл уже существует
zh: 创建失败，已有同名文件

source: Adjust UI size
ru: Настроить размер интерфейса
zh: 调整界面大小

# currentScale
source: Current scale: {percent}%
ru: Текущий масштаб: {percent}%
zh: 当前缩放: {percent}%

source: Small
ru: Малый
zh: 小

source: Standard
ru: Стандартный
zh: 标准

source: Large
ru: Большой
zh: 大

source: Done
ru: Готово
zh: 完成

source: Reset
ru: Сброс
zh: 重置

# cacheCleared
source: Cleared {count} cached files
ru: Очищено файлов в кэше: {count}
zh: 已清理 {count} 个缓存文件

# returnUp
source: Back
ru: Назад
zh: 返回上一级

source: JSON file
ru: JSON-файл
zh: JSON 文件

source: Software intro
ru: О программе
zh: 软件介绍

# pvzEditorSubtitle
source: PVZ2 Visual Level Editor
ru: Визуальный редактор уровней PVZ2
zh: PVZ2 关卡可视化编辑器

# introSection
source: Introduction
ru: Введение
zh: 简介

# introText
source: Z-Editor is a visual level editing tool designed for Plants vs. Zombies 2. It aims to simplify editing level JSON files with an intuitive interface.
ru: Z-Editor — визуальный редактор уровней для Plants vs. Zombies 2. Упрощает редактирование JSON-файлов уровней с помощью интуитивного интерфейса.
zh: Z-Editor 是一款专为《植物大战僵尸2》设计的可视化关卡编辑工具。它旨在解决直接修改 JSON 文件繁琐、易错的问题，提供直观的图形界面来管理关卡配置。

# featuresSection
source: Core features
ru: Основные возможности
zh: 核心功能

# feature1
source: Modular editing: Manage level modules and events.
ru: Модульное редактирование: управление модулями и событиями уровней.
zh: 模块化编辑：对关卡模块和事件进行模块化管理。

# feature2
source: Multi-mode: I, Zombie, Vase Breaker, Last Stand, Zomboss battle.
ru: Режимы: «Я зомби», «Разбей горшки», «Несокрушимый», бой с Зомбоссом.
zh: 多模式支持：我是僵尸、砸罐子、坚不可摧、僵王战等。

# feature3
source: Custom zombies: Inject and edit custom zombie properties.
ru: Пользовательские зомби: добавление и редактирование свойств.
zh: 自定义注入：在关卡内注入并管理自定义僵尸。

# feature4
source: Validation: Detect missing modules and broken references.
ru: Проверка: обнаружение отсутствующих модулей и неверных ссылок.
zh: 智能校验：检测模块依赖缺失、引用失效等问题。

# usageSection
source: Usage
ru: Использование
zh: 使用说明

# usageText
source: 1. Folder: Tap folder icon to choose level JSON directory. 2. Open/Create: Tap a level to edit or use + to create from template. 3. Modules: Add modules in the editor. 4. Save: Tap save to write back to the JSON file. QQ group: 562251204
ru: 1. Папка: нажмите на иконку папки, чтобы выбрать каталог с уровнями. 2. Открыть/Создать: нажмите на уровень для редактирования или «+» для создания из шаблона. 3. Модули: добавляйте модули в редакторе. 4. Сохранить: нажмите «Сохранить» для записи в JSON. QQ-группа: 562251204
zh: 1. 目录设置：首次进入请选择存放 JSON 关卡文件的目录。 2. 导入/新建：点击列表项编辑现有关卡，或使用右下角按钮基于模板新建。 3. 模块管理：在编辑器中可添加新模块。 4. 保存关卡：编辑完成后点击保存，文件将回写到原 JSON。 交流 QQ 群：562251204

# creditsSection
source: Credits
ru: Благодарности
zh: 致谢名单

# authorLabel
source: Author:
ru: Автор:
zh: 软件作者：

# thanksLabel
source: Thanks:
ru: Благодарность:
zh: 特别鸣谢：

# tagline
source: Create infinite possibilities
ru: Создавайте бесконечные возможности
zh: 穿越时空 创造无穷可能

# version
source: Version {version}
ru: Версия {version}
zh: 版本 {version}

source: Language
ru: Язык
zh: 语言

# templateBlankLevel
source: Blank level
ru: Пустой уровень
zh: 空白关卡

# templateCardPickExample
source: Card pick example
ru: Пример выбора карт
zh: 自选卡示例

# templateConveyorExample
source: Conveyor example
ru: Пример конвейера
zh: 传送带示例

# templateLastStandExample
source: Last stand example
ru: Пример «Несокрушимый»
zh: 坚不可摧示例

# templateIZombieExample
source: I, Zombie example
ru: Пример «Я зомби»
zh: 我是僵尸示例

# templateVaseBreakerExample
source: Vase breaker example
ru: Пример «Разбей горшки»
zh: 砸罐子示例

# templateZombossExample
source: Zomboss battle example
ru: Пример боя с Зомбоссом
zh: 僵王战示例

# templateCustomZombieExample
source: Custom zombie example
ru: Пример пользовательского зомби
zh: 自定义僵尸示例

# templateIPlantExample
source: I, Plant example
ru: Пример «Я растение»
zh: 我是植物示例

source: Unsaved changes
ru: Несохранённые изменения
zh: 未保存的更改

source: Save before leaving?
ru: Сохранить перед выходом?
zh: 离开前是否保存？

source: Discard
ru: Не сохранять
zh: 放弃

source: Saved
ru: Сохранено
zh: 已保存

source: Failed to load level
ru: Не удалось загрузить уровень
zh: 加载关卡失败

source: No level definition
ru: Определение уровня не найдено
zh: 未找到关卡定义

# noLevelDefinitionHint
source: Level definition module (LevelDefinition) was not found. This is the base node of the level file. Try adding it manually.
ru: Модуль определения уровня (LevelDefinition) не найден. Это базовый узел файла уровня. Попробуйте добавить его вручную.
zh: 当前关卡内未找到关卡定义模块 (LevelDefinition)，这是关卡文件的基础节点。请尝试手动添加。

source: Level basic info
ru: Основные данные уровня
zh: 关卡基本信息

# levelBasicInfoSubtitle
source: Name, number, description, stage
ru: Название, номер, описание, стадия
zh: 名称、序号、描述、地图背景

source: Remove module
ru: Удалить модуль
zh: 移除模块

# removeModuleConfirm
source: Remove this module? Local custom modules (@CurrentLevel) and their data will be deleted permanently.
ru: Удалить этот модуль? Локальные модули (@CurrentLevel) и их данные будут удалены безвозвратно.
zh: 确定要移除该模块吗？本地自定义模块(@CurrentLevel)及其关联数据将一并删除，不可恢复。

# confirmRemove
source: Remove
ru: Удалить
zh: 确认移除

source: Add module
ru: Добавить модуль
zh: 添加模块

source: Settings
ru: Настройки
zh: 设置

source: Timeline
ru: Волны
zh: 波次时间线

source: I, Zombie
ru: Я зомби
zh: 我是僵尸

source: Vase breaker
ru: Разбей горшки
zh: 砸罐子

source: Zomboss
ru: Зомбосс
zh: 僵王战

# moveSourceSameAsDest
source: Source and target folder are the same
ru: Исходная и целевая папки совпадают
zh: 源目录和目标目录相同

# moveSuccess
source: Moved successfully
ru: Перемещение выполнено
zh: 移动成功

# moveFail
source: Move failed
ru: Ошибка перемещения
zh: 移动失败

# rootFolder
source: Root
ru: Корень
zh: 根目录

source: Create empty wave
ru: Создать пустую волну
zh: 创建空波次容器

# noWaveManager
source: No wave manager found
ru: Менеджер волн не найден
zh: 未找到波次管理器

# noWaveManagerHint
source: This level has wave management but no WaveManagerProperties object.
ru: У уровня есть модуль волн, но отсутствует объект WaveManagerProperties.
zh: 此关卡有波次管理模块但缺少 WaveManagerProperties 对象。

# waveTimelineHint
source: Tap event to edit. Tap + to add event.
ru: Нажмите на событие для редактирования. Нажмите + для добавления.
zh: 点击事件编辑，点击 + 添加事件。

# waveTimelineHintDetail
source: Swipe wave left to delete.
ru: Смахните влево для удаления волны.
zh: 左滑波次可删除。

source: Wave manager settings
ru: Настройки менеджера волн
zh: 波次管理器设置

source: Flag interval
ru: Интервал флага
zh: 旗帜间隔

source: No waves
ru: Нет волн
zh: 暂无波次

# addFirstWave
source: Add the first wave.
ru: Добавьте первую волну.
zh: 添加第一个波次。

# deleteWave
source: Delete
ru: Удалить
zh: 删除

# deleteWaveConfirm
source: This will remove this wave and its {count} events.
ru: Будет удалена эта волна и её {count} событий.
zh: 将移除此波次及其 {count} 个事件。

source: Add event
ru: Добавить событие
zh: 添加事件

source: Empty wave
ru: Пустая волна
zh: 空波次

source: Add wave
ru: Добавить волну
zh: 添加波次

source: Expectation
ru: Ожидание
zh: 期望

source: Close
ru: Закрыть
zh: 关闭

source: Edit properties
ru: Редактировать свойства
zh: 编辑属性

source: Delete entity
ru: Удалить объект
zh: 删除实体

# moduleEditorInProgress
source: Module editor in development
ru: Редактор модуля в разработке
zh: 模块编辑器开发中

# dataEmpty
source: Data is empty
ru: Данные пусты
zh: 数据为空

# saveSuccess
source: Save successful
ru: Сохранено успешно
zh: 保存成功

# saveFail
source: Save failed
ru: Ошибка сохранения
zh: 保存失败

# confirmRemoveRef
source: Remove reference
ru: Удалить ссылку
zh: 移除引用

# confirmRemoveRefMessage
source: Remove this reference? The entity data will remain until all references are removed.
ru: Удалить эту ссылку? Данные объекта останутся до удаления всех ссылок.
zh: 确定要移除此引用吗？实体数据将保留直至所有引用被移除。

source: Code
ru: Код
zh: 代码

source: Name
ru: Название
zh: 名称

source: Description
ru: Описание
zh: 描述

source: Level number
ru: Номер уровня
zh: 关卡序号

source: Starting sun
ru: Начальное солнце
zh: 初始阳光

source: Stage module
ru: Стадия
zh: 关卡地图

source: Music type
ru: Тип музыки
zh: 音乐类型

source: Loot
ru: Добыча
zh: 关卡默认掉落

source: Victory module
ru: Условие победы
zh: 胜利结算方式

source: Missing modules
ru: Отсутствующие модули
zh: 缺失模块

source: Module conflict
ru: Конфликт модулей
zh: 模块冲突

source: Editable modules
ru: Редактируемые модули
zh: 可用编辑模块

source: Parameter modules
ru: Модули параметров
zh: 默认参数模块

source: Add new module
ru: Добавить модуль
zh: 添加新模块

source: Select stage
ru: Выбрать стадию
zh: 选择地图

# searchStage
source: Search stage name or alias
ru: Поиск стадии
zh: 搜索地图名称或代号

source: No stage found
ru: Стадия не найдена
zh: 未找到相关地图

# stageTypeAll
source: All
ru: Все
zh: 全部地图

# stageTypeMain
source: Main
ru: Основные
zh: 主线世界

# stageTypeExtra
source: Extra
ru: Дополнительные
zh: 活动/秘境

# stageTypeSeasons
source: Seasons
ru: Сезоны
zh: 一代/季节

# stageTypeSpecial
source: Special
ru: Мини-игры
zh: 小游戏

source: Search
ru: Поиск
zh: 搜索

source: Disable peavine
ru: Отключить плющ
zh: 禁用豆藤共生

source: Disable artifact
ru: Отключить артефакт
zh: 禁用神器

source: Select plant
ru: Выбрать растение
zh: 选择植物

source: Search plant
ru: Поиск растения
zh: 搜索植物

source: No plant found
ru: Растение не найдено
zh: 未找到植物

# noResultsFor
source: No results for "{query}"
ru: Нет результатов для «{query}»
zh: 没有关于“{query}”的结果

# noModulesInCategory
source: No modules in this category
ru: Нет модулей в этой категории
zh: 该分类下没有模块

# addEventForWave
source: Add event for wave {wave}
ru: Добавить событие для волны {wave}
zh: 为第 {wave} 波添加事件

# waveLabel
source: Wave
ru: Волна
zh: 波次

# pointsLabel
source: Points
ru: Очки
zh: 点数

source: No dynamic zombies
ru: Нет динамических зомби
zh: 没有动态僵尸

# iZombiePlantReserveLabel
source: Plant Reserve Column (PlantDistance)
ru: Колонна резерва растений (PlantDistance)
zh: 植物预留列（PlantDistance）

source: Column
ru: Колонна
zh: 列

# iZombieInfoText
source: In I, Zombie mode, preset plants and zombies must be configured in the Level Module (Preset Plants) and Seed Bank respectively.
ru: В режиме «Я, Зомби» предварительные растения и зомби необходимо настроить в модуле уровня (Preset Plants) и в банке семян.
zh: 在“我是僵尸”模式下，需在关卡模块（预设植物）和种子库中配置预设植物与僵尸。

# vaseRangeTitle
source: Vase Generation Range & Blacklist
ru: Диапазон генерации ваз и черный список
zh: 花瓶生成范围与黑名单

# startColumnLabel
source: Start Col (Min)
ru: Начальная колонна (мин.)
zh: 起始列（最小）

# endColumnLabel
source: End Col (Max)
ru: Конечная колонна (макс.)
zh: 结束列（最大）

# toggleBlacklistHint
source: Click to toggle blacklist
ru: Нажмите, чтобы переключить черный список
zh: 点击切换黑名单

# vaseCapacityTitle
source: Vase Capacity
ru: Вместимость ваз
zh: 花瓶容量

# vaseCapacitySummary
source: Assigned: {current} / Total Slots: {total}
ru: Назначено: {current} / Всего ячеек: {total}
zh: 已分配：{current} / 总槽位：{total}

# vaseListTitle
source: Vase List
ru: Список ваз
zh: 花瓶列表

# addVaseTitle
source: Add Vase
ru: Добавить вазу
zh: 添加花瓶

# plantVaseOption
source: Plant Vase
ru: Ваза с растением
zh: 植物花瓶

# zombieVaseOption
source: Zombie Vase
ru: Ваза с зомби
zh: 僵尸花瓶

source: Select zombie
ru: Выбрать зомби
zh: 选择僵尸

source: Search zombie
ru: Поиск зомби
zh: 搜索僵尸

source: No zombie found
ru: Зомби не найден
zh: 未找到僵尸

# unknownVaseLabel
source: Unknown Vase
ru: Неизвестная ваза
zh: 未知花瓶

# plantLabel
source: Plant
ru: Растение
zh: 植物

# zombieLabel
source: Zombie
ru: Зомби
zh: 僵尸

# itemLabel
source: Item
ru: Предмет
zh: 物品

source: Railcart settings
ru: Настройки рельсов
zh: 矿车轨道设置

source: Railcart type
ru: Тип вагонетки
zh: 矿车类型

source: Lay rails
ru: Уложить рельсы
zh: 铺设轨道

source: Place carts
ru: Разместить вагонетки
zh: 放置矿车

source: Rail segments
ru: Сегменты рельсов
zh: 轨道段数

source: Railcart count
ru: Количество вагонеток
zh: 矿车数量

source: Clear all
ru: Очистить всё
zh: 清空所有配置

# eventTitle_SpawnZombiesFromGroundSpawnerProps
source: Ground Spawn
ru: Земляной спавн
zh: 地底出怪

# eventDesc_SpawnZombiesFromGroundSpawnerProps
source: Zombies spawn from ground
ru: Зомби появляются из-под земли
zh: 从地下生成僵尸

# eventTitle_SpawnZombiesJitteredWaveActionProps
source: Standard Spawn
ru: Стандартный спавн
zh: 标准出怪

# eventDesc_SpawnZombiesJitteredWaveActionProps
source: Basic natural spawn
ru: Основной естественный спавн
zh: 基本自然出怪

# eventTitle_FrostWindWaveActionProps
source: Frost Wind
ru: Морозный ветер
zh: 霜冻风

# eventDesc_FrostWindWaveActionProps
source: Freezing wind on rows
ru: Холодный ветер по рядам
zh: 行上的冰冻风

# eventTitle_BeachStageEventZombieSpawnerProps
source: Low Tide
ru: Низкая вода
zh: 低潮

# eventDesc_BeachStageEventZombieSpawnerProps
source: Zombies spawn at low tide
ru: Зомби появляются при низкой воде
zh: 僵尸在低潮时出现

# eventTitle_TidalChangeWaveActionProps
source: Tide Change
ru: Смена прилива
zh: 潮汐变化

# eventDesc_TidalChangeWaveActionProps
source: Change tide position
ru: Изменение уровня прилива
zh: 改变潮位位置

# eventTitle_ModifyConveyorWaveActionProps
source: Conveyor Modify
ru: Изменение конвейера
zh: 传送带修改

# eventDesc_ModifyConveyorWaveActionProps
source: Add/remove cards dynamically
ru: Динамическое добавление/удаление карт
zh: 动态添加/移除卡牌

# eventTitle_DinoWaveActionProps
source: Dino Summon
ru: Призыв динозавра
zh: 恐龙召唤

# eventDesc_DinoWaveActionProps
source: Summon dinosaur on row
ru: Призвать динозавра на ряд
zh: 在行上召唤恐龙

# eventTitle_SpawnModernPortalsWaveActionProps
source: Time Rift
ru: Разлом времени
zh: 时空裂隙

# eventDesc_SpawnModernPortalsWaveActionProps
source: Summon time rift
ru: Создать порталы времени
zh: 生成时空裂隙

# eventTitle_StormZombieSpawnerProps
source: Storm Spawn
ru: Штормовой спавн
zh: 风暴出怪

# eventDesc_StormZombieSpawnerProps
source: Sandstorm or blizzard spawn
ru: Песчаная буря или метель
zh: 沙尘暴或暴雪出怪

# eventTitle_RaidingPartyZombieSpawnerProps
source: Raiding Party
ru: Налет пиратов
zh: 海盗掠夺队

# eventDesc_RaidingPartyZombieSpawnerProps
source: Swashbuckler invasion
ru: Разбойники/пиратские зомби вторгаются
zh: 海盗僵尸入侵

# eventTitle_ZombiePotionActionProps
source: Potion Drop
ru: Бросок зелий
zh: 药水掉落

# eventDesc_ZombiePotionActionProps
source: Spawn potions on grid
ru: Появление зелий на сетке
zh: 在网格上生成药水

# eventTitle_SpawnGravestonesWaveActionProps
source: Gravestone Spawn
ru: Спавн надгробий
zh: 墓碑生成

# eventDesc_SpawnGravestonesWaveActionProps
source: Spawn gravestones
ru: Создать надгробия
zh: 生成墓碑

# eventTitle_SpawnZombiesFromGridItemSpawnerProps
source: Grave Spawn
ru: Спавн из надгробий
zh: 墓碑出怪

# eventDesc_SpawnZombiesFromGridItemSpawnerProps
source: Spawn zombies from graves
ru: Появление зомби из могил
zh: 从墓碑生成僵尸

# eventTitle_FairyTaleFogWaveActionProps
source: Fairy Fog
ru: Сказочный туман
zh: 童话迷雾

# eventDesc_FairyTaleFogWaveActionProps
source: Spawn fog
ru: Породить туман
zh: 生成迷雾

# eventTitle_FairyTaleWindWaveActionProps
source: Fairy Wind
ru: Сказочный ветер
zh: 童话之风

# eventDesc_FairyTaleWindWaveActionProps
source: Blow away fog
ru: Сдувать туман
zh: 吹散迷雾

# eventTitle_SpiderRainZombieSpawnerProps
source: Imp Rain
ru: Дождь импов
zh: 小鬼雨

# eventDesc_SpiderRainZombieSpawnerProps
source: Imps drop from sky
ru: Импы падают с неба
zh: 小鬼从天而降

# eventTitle_ParachuteRainZombieSpawnerProps
source: Parachute Rain
ru: Парашютный дождь
zh: 降落伞雨

# eventDesc_ParachuteRainZombieSpawnerProps
source: Zombies drop with parachutes
ru: Зомби падают с парашютами
zh: 僵尸带降落伞降落

# eventTitle_BassRainZombieSpawnerProps
source: Bass/Jetpack Rain
ru: Дождь басистов/джетпаков
zh: 低音/喷气背包雨

# eventDesc_BassRainZombieSpawnerProps
source: Bass/Jetpack zombies drop
ru: Падают басисты/джетпак-зомби
zh: 低音/喷气背包僵尸降落

# eventTitle_BlackHoleWaveActionProps
source: Black Hole
ru: Чёрная дыра
zh: 黑洞

# eventDesc_BlackHoleWaveActionProps
source: Black hole attracts plants
ru: Чёрная дыра притягивает растения
zh: 黑洞吸引植物

# eventTitle_WaveActionMagicMirrorTeleportationArrayProps2
source: Magic Mirror
ru: Волшебное зеркало
zh: 魔镜

# eventDesc_WaveActionMagicMirrorTeleportationArrayProps2
source: Mirror portals
ru: Зеркальные порталы
zh: 镜子传送门
